package com.javarush.task.task15.task1530;

/* Задача 1530 - Патерн "Шаблонный метод"
 * Приготовление чая и кофе почти одинаковы, кроме скольких шагов. Одинаковое - в общий абстрактный класс
 * разное в классы чая и кофе. (ну и хуков понатыкать побольше.
 * Хуки - это методы, которые выполняются до и после шагов алгоритма. По умолчанию они пустые и позволяют подкорректировать алгоритм)
 * (В данном примере было бы нагляднее сделать некоторые шаги алгоритма общими, например берем чашку или заливаем кипятком)
 *
 * Сказать, что этот патерн используется везде - это не сказать ничего
 * Во всех CMS есть стандартизированные алгоритмы всех событий и хуки, которые позволяют их модифицировать
 * в любом проекте есть куча стандартизированных методов с общими шагами подключения к внешнему источнику
 *
 * подробней о шаблонном методе https://refactoring.guru/ru/design-patterns/template-method/java/example
 *
Template pattern
*/

public class Solution {
    public static void main(String[] args) {
    }
}
